{
    "version": "0.6",
    "pageContent": 
	{
        "_comments": "JSON object that contains data for page labels, buttons, etc.",
        "navItems": 
		{
            "_common": 
			{
                "buttonBackToGallery": 
				{
                    "name": "Back To Gallery",
					"method": "backToGallery()",
					"idName": "backToGallery"	
                },
                "buttonStartTutorial": 
				{
                    "name": "Start Tutorial",
					"method": "startTutorialFromDetailsScreen()",
					"idName": "startTutorial"
                },
				"buttonViewDetails": 
				{
                    "name": "View Details",
					"method": "viewDetails()",
					"idName": "stepsViewDetails"	
                }
            }
        }
    },
    "tutorial": 
	{
        "_common": 
		{
            "name": "Subscribing to receive MQTT events",
            "shortDescription": "Learn how to use the MQTT Subscribe node to receive data from an MQTT broker.",
            "durationText": "This tutorial takes approximately",
            "durationTime": "5 minutes",
            "_resourceToOpenComment": "The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
            "resourceToOpen": "MQTTSubscribe",
            "helpLink": 
			{
                "text": "IBM Knowledge Center",
                "link": "/com.ibm.etools.msgbroker.helphome.doc/help_home_msgbroker.htm"
            }
        },
        "pageDetails": 
		{
            "topicsName": "Tutorial Topics",
            "_topicListComment": "A short list of product concepts or tasks demonstrated by this tutorial",
            "topicList": 
			[
                {
                    "title": "MQTTSubscribe node"
                }
            ],
            "outcomesName": "Learning outcomes",
            "_outcomesComment": "A description of what the user will have learned or accomplished by running this tutorial.",
            "outcomeList": 
			[
                {
                    "title": "Use IBM Integration Bus to receive data from an MQTT broker."
                }
            ],
            "summary": 
			{
                "overviewName": "OVERVIEW",
                "_overviewComment": "A short description of what happens in this tutorial, and an optional short explanation of the IIB concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
                "sections": 
				[
                    {
                        "section": "This tutorial demonstrates a simple message flow that connects to IBM's Internet of Things Foundation and receives events published by a device simulator over the MQTT protocol. The message flow writes the event data to a file."
                    },
                    {
                        "section": "MQTT is a open protocol for remote communication using a publish and subscribe model. Devices and applications can publish data on named topics and other applications or devices can subscribe to receive data that are published on particular topics. IBM Internet of Things (IoT) Foundation hosts a quickstart demonstration service. This tutorial connects to that service and illustrates how to use a message fow to receive data over MQTT. To publish the data, you will use the device simulator provided by the IoT Foundation."
                    },
                    {
                        "section": "IBM Internet of Things (IoT) Foundation hosts an MQTT broker on the internet and provides a quickstart demonstration service. This tutorial connects to that service and illustrates how to use a message fow to receive data over MQTT. To publish the data, you will use the device simulator provided by the IoT Foundation."
                    }
                ]
            },
			"helpLinks": 
			{
				"_helpLinksComment": "Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
				"title": "Find out more",
				"details": 
				[
					{
						"title": "MQTT.ORG",
						"description": "Information about the MQTT open standard",
						"link": "http://mqtt.org/",
						"type": "web"
					},
					{
						"title": "Knowledge Center link to ",
						"description": "Processing MQTT messages in IBM Integration Bus",
						"link": "com.ibm.etools.mft.doc/bc62000_.htm",
						"type": "help"
					},
										{
						"title": "Knowledge Center link to ",
						"description": "MQTTSubscribe node",
						"link": "com.ibm.etools.mft.doc/bc46000_.htm",
						"type": "help"
					},
					{
						"title": "IBM Internet of Things Foundation",
						"description": "IBM Internet of Things Foundation",
						"link": "https://internetofthings.ibmcloud.com/#/",
						"type": "web"
					},
					{
						"title": "IBM Internet of Things Foundation",
						"description": "Connecting applications to IoT Foundation quickstart",
						"link": "https://developer.ibm.com/iot/recipes/application-development-quickstart/",
						"type": "web"
					},
					{
						"title": "IBM Internet of Things Foundation",
						"description": "Device simulator for IoT Foundation quickstart",
						"link": "https://developer.ibm.com/iot/recipes/simulator/",
						"type": "web"
					}
					
				]
			}
        },
        "pageSteps": 
		{
            "create": 
			{
                "overview": 
				{
                    "name": "Create",
                    "heading": "Create the message flow and the device",
                    "_createComment": "A description of what will happen when the user clicks Import.",
                    "sections": 
					[
                        {
                            "section": "Create a device that is connected to IoT Foundation and will publish data on a topic that the message flow can subscribe to.",
                            "steps": 
							{
                                "type": "ordered",
                                "details": 
								[
                                    {
                                        "details": "On your smartphone/tablet/computer, start the simulator by browsing to <a href='http://quickstart.internetofthings.ibmcloud.com/iotsensor' target='_blank'>http://quickstart.internetofthings.ibmcloud.com/iotsensor</a>. The simulator connects automatically and starts publishing data. Keep your simulator window active and in the foreground."
                                    },
                                    {
                                        "details":"Take a note of the MAC address of the device. This is seen in the top right of the device screen. You will need this to complete the configuration of the message flow."
                                    
                                    }
                                ]
							}
                        },
                        {
                            "section": "Import and complete the configuration of the message flow.",
                            "steps": 
							{
                                "type": "ordered",
                                "details": 
								[
								    {
								        "details": "Click the <span class='uicontrol'>Import</span> button on the right of this view and the MQTTSubscribe application which includes a partially complete Message flow will be imported into your workspace."
								    },
                                    {
                                        "details": "The <span class='uicontrol'>MQTTSubscribe</span> message flow should be open in the Message Flow editor. If not, locate it under the flows section of the <span class='application'>MQTTSubscribe</span> application and double click to open it for editing."
                                    },
                                    {
                                        "details":"Select the MQTTSubscribe node in the message flow and look at the <span class='uicontrol'>Properties</span> view"
                                    },
                                    {
                                        "details":"The <span class='parmname'>Client ID</span> property is blank and must be configured with a valid value. Enter the value <span class='userinput'>a:quickstart:&lt;unique-name&gt;</span> where <span class='userinput'>&lt;unique-name&gt;</span> is a value that you can chose and is unlikely to be chosen by anyone else. For example, choosing my name and birth year to avoid clashing with other people, I would enter <span class='userinput'>a:quickstart:hosie75</span>.",
                                        "substeps": 
						                {   
							                "type": "unordered",
							                "details": 
							                [
								            {
									            "details": "<b>You might like to know:</b> In the MQTT protocol, the client id is used to uniquely identify a device or an instance of an application that is connected to an MQTT broker. Each device and application must specify a different client id. In any particular instance of an MQTT broker, there may be a certain convention to follow when choosing the client id. In the case of IBM IoT Foundation quickstart, the convention is that applications must specify a client id with the form <span class='code'>a:quickstart:&lt;unique-name&gt;</span> where <span class='code'>&lt;unique-name&gt</span> is a value chose by the application to be unique across all applications connecting to the quickstart service. This convention must be followed otherwise the application will fail to connect to the IoT Foundation"
								            }
							                ]
						                }
                                    },
                                    {
                                        "details":"The <span class='parmname'>Topic name</span> property is blank and must be configured with a valid value. Enter the value  <span class='userinput'>iot-2/type/+/id/&lt;deviceid&gt;/evt/+/fmt/+</span> where <span class='userinput'>&lt;deviceid&gt;</span> is the MAC address of the device, that you simulated in the earlier step, with colons removed and all letters in lower case. For example, if the MAC Address of your device is C2:AC:80:42:DA:D7 then the Topic name must be entered as <span class='userinput'>iot-2/type/+/id/c2ac8042dad7/evt/+/fmt/+</span>.",
                                        "substeps": 
						                {   
							                "type": "unordered",
							                "details": 
							                [
								            {
									            "details": "<b>You might like to know:</b> When data is published over MQTT, they are published on a particular topic. The topic string is hierarchical and is normally used to indicate some categorisation of the data that is meaningful in the particular domain. Applications subscribe to particular topics and can use wildcards to subscribe to many topics with a single topic string. In the case of IoT foundation quickstart, the topic name includes the id of the device that published the data. Subscribing applications must specify the device id explicitly although wildcard (<span class='code'>+</span>) may be used elsewhere in the topic string, as we have done in this tutorial."
								            }
							                ]
						                }
                                    },
                                    {
                                        "details":"Save the message flow."
                                    },
                                    {
                                        "details":"Ensure that there no errors associated with the message flow."
                                    }
                                ]
							}
                        }
                    ]
                },
                "helpLinks": 
				{
                    "title": "Find out more",
                    "details": 
					[
                       {
						"title": "MQTT.ORG",
						"description": "Information about the MQTT open standard",
						"link": "http://mqtt.org/",
						"type": "web"
					},
					{
						"title": "Knowledge Center link to ",
						"description": "Processing MQTT messages in IBM Integration Bus",
						"link": "com.ibm.etools.mft.doc/bc62000_.htm",
						"type": "help"
					},
										{
						"title": "Knowledge Center link to ",
						"description": "MQTTSubscribe node",
						"link": "com.ibm.etools.mft.doc/bc46000_.htm",
						"type": "help"
					},
					{
						"title": "IBM Internet of Things Foundation",
						"description": "IBM Internet of Things Foundation",
						"link": "https://internetofthings.ibmcloud.com/#/",
						"type": "web"
					},
					{
						"title": "IBM Internet of Things Foundation",
						"description": "Connecting applications to IoT Foundation quickstart",
						"link": "https://developer.ibm.com/iot/recipes/application-development-quickstart/",
						"type": "web"
					},
					{
						"title": "IBM Internet of Things Foundation",
						"description": "Device simulator for IoT Foundation quickstart",
						"link": "https://developer.ibm.com/iot/recipes/simulator/",
						"type": "web"
					}
                    ]
                },
                "actions": 
				{
                    "title": "Create Actions",
                    "details": 
					[
                        {
                            "name": "Import",
                            "method": "importArtifacts()"
                        }
                    ]
                }
            },
            "prepare": 
			{
                "overview": 
				{
                    "name": "Prepare",
                    "heading": "Deploy Application",
                    "_prepareComment": "A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
                    "sections": 
					[
                        {
                            "section": "Before deploying the application, we must make sure that the file system is ready for the data to be written to the output file by the message flow."
                        },
                        {
                            "section": "The file output node is configured to write the data to a file in the output directory <span class='userinput'>C:\\fileout</span>",
                            "steps": 
							{
                                "type": "unordered",
                                "details": 
								[
                                    {
                                        "details": "Create the output directory <span class='userinput'>C:\\fileout</span> on your local filesystem or change the <span class='parmname'>Directory</span> property of the FileOutput node to a directory that exists and your current user id has write access.",
                                        "substeps": 
						                {   
							                "type": "unordered",
							                "details": 
							                [
								            {
									            "details": "If you are using Linux, then you will probably need to change the <span class='parmname'>Directory</span> property."
								            }
							                ]
						                }
                                    }
                                ]
							}
                        },
                        {
                            "section": "Once you have completed these steps, drag the <span class='application'>MQTTSubscribe</span> application from the <span class='uicontroll'>Application Development</span> view and drop it on an integration server in the <span class='uicontroll'>Integration Nodes</span> view. The application will be deployed to the integration server and the message flow will connect to the IoT foundation, ready to receive the data published by your device."
                        }
                    ]
                },
                "helpLinks": 
				{
                    "title": "Find out more",
                    "details": 
					[
                        {
				            "title":"Knowledge Center link to ",
				            "description":"Working with files",
				            "link":"com.ibm.etools.mft.doc/ac55170_.htm"
                        }
                    ]
                },
                "actions-remove": 
				{
				    "comment":" as the user needs to configure some of the properites on the flow in the create steap, we cannot have a pre-buitl bar file, therefore cannot use the deploy action",
                    "title": "Prepare Actions",
                    "details": 
					[
                        {
                            "name": "Deploy",
                            "method": "deployArtifacts()"
                        }
                    ]
                }
            },
            "run": 
			{
                "overview": 
				{
                    "name": "Run",
                    "heading": "Follow these steps to complete the tutorial",
                    "_runComment": "The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
                    "sections": 
					[
                        {
                            "section": "The message flow will immediately start receving data, that is published by the device simulator that you launched in the <span class='uicontrol'>Create</span> step, and will write that data to a file in the directory that you created in the <span class='uicontrol'>prepare</span> step."
                        },
                        {
                            "section": "Change some of the metrics ( temparature/humidity) on the device simulator and open the output file again to see new events with those values appended at the end of the file."
                        },
                        {
                            "section": "In addition to this, you can use the flow exerciser to inspect other information, about the publication, that is avaialbe in the message flow",
                            "steps": 
							{
                                "type": "ordered",
                                "details": 
								[
                                    {
                                        "details": "Open the MQTTSubscribe message flow, and click the Flow Exerciser icon <img src='http://ot4i.github.io/ot4i.tutorials//dist/images/icons/iib/startFlowExerciser.png' alt='' /> to start recording the message path through the flow."
                                    },
                                    {
                                        "details": "Wait a few seconds to ensure that, at least one, event is published."
                                    },
                                    {
                                        "details": "In the Integration Toolkit Flow Exerciser toolbar, click the View Path icon <img src='http://ot4i.github.io/iib-tutorials/images/icons/iib/viewPath.png' alt='View path' /> to highlight the message path through the message flow. Click on any highlighted connection to see the message data that passed between the MQTTSubscribe node and the FileOutput node."
                                    },
                                    {
                                        "details": "In the <span class='code'>Message</span> tree, you will see the <span class='code'>Properties</span> folder followed by a <span class='code'>JSON</span> folder that shows the same data that was written to the output file.",
                                        "substeps": 
										{
                                            "type": "unordered",
                                            "details": 
											[
                                                {
                                                    "details": "NOTE: the data is formated as XML by the UI for the puposes of rendering it through the flow exerciser but in reality, it remains as JSON as passes from IoT foundation, through the message flow and into the output file."
                                                }
                                            ]
                                        }
                                    },
                                    {
                                        "details": "Expand the <span class='code'>LocalEnvironment</span> folder and you will see extra information about the publication. It woudl be possible to add other nodes to the message flow that could process this information or even copy it to the output file."
                                    }
                                ]
                            }
                        }
                    ]
                },
                "helpLinks": 
				{
                    "title": "Find out more",
                    "details": 
					[
                        {
                            "title": "Knowledge Center link to ",
                            "description": "Using local environment variables with MQTT nodes",
                            "link": "com.ibm.etools.mft.doc/bc62011_.htm"
                        },
                        {
                            "title": "Knowledge Center link to ",
                            "description": "Testing your message flow by using the Flow exerciser",
                            "link": "com.ibm.etools.mft.doc/rt26110_.htm"
                        }
                    ]
                },
                "exits": 
				{
					"title": "Run Exits",
					"details": 
					[
						{
							"name": "Clean Up",
							"description": "Clean up and remove any changes in your workspace made by the tutorial.",
							"method": "cleanUp()"
						}
					]
				}
            }
        }
    }
}

